{
    "announcements": [
        {
            "title": "🚀 Welcome to CloutScape - The Ultimate RSPS Experience! 🚀",
            "description": "Greetings, adventurers! Welcome to **CloutScape**, where classic RuneScape nostalgia meets modern innovation. We're thrilled to have you join our community of passionate players and dedicated staff.\n\n### What is CloutScape?\n\nCloutScape is a unique 317 revision RSPS, seamlessly integrated with Discord to provide a smooth, secure, and engaging gameplay experience. Whether you're a seasoned veteran or a newcomer to the world of RuneScape, you'll find a home here.\n\n### 🔥 **What's New & Exciting?** 🔥\n\n- **Seamless Discord Integration**: Register your account, check your stats, and manage your gameplay directly through Discord.\n- **Zero-Hassle Connection**: Thanks to our Cloudflare integration, you can connect to the game without any complicated port forwarding.\n- **Provocative PvP**: Engage in thrilling player-versus-player combat and climb the leaderboards to prove your dominance.\n- **High-Stakes Gambling**: Test your luck with our variety of gambling games, from dice to flower poker.\n- **Engaging Events**: Participate in server-wide events, tournaments, and giveaways for your chance to win epic prizes.\n\n### 📢 **Stay Connected!**\n\n- **#general**: Jump into the conversation with fellow players.\n- **#game-guide**: New here? Check out our guide to get started.\n- **#support**: Need help? Our support team is here for you.\n\nWe're committed to creating the most ambitious and engaging RSPS community. Your adventure starts now!\n\n**The CloutScape Team**"
        }
    ],
    "game-guide": [
        {
            "title": "🎮 CloutScape - Your Adventure Begins Here! 🎮",
            "description": "Welcome to the official CloutScape game guide! This guide will walk you through everything you need to know to start your journey in our immersive world.\n\n### **Step 1: Create Your Account**\n\nCreating an account is simple and secure, thanks to our Discord integration.\n\n1.  Navigate to the `#bot-commands` channel.\n2.  Type the command: `!register YourDesiredUsername`\n3.  Check your Direct Messages (DMs) from the CloutScape bot for your unique password.\n\n### **Step 2: Download the Game Client**\n\nOur custom game client is lightweight and easy to use.\n\n1.  In the `#bot-commands` channel, type: `!download`\n2.  You'll receive a direct link to download the `client.jar` file.\n3.  **Prerequisite**: Ensure you have Java 11 or higher installed on your computer. If not, you can download it from the official [Java website](https://www.java.com/en/download/).\n\n### **Step 3: Log In and Play!**\n\n1.  Double-click the `client.jar` file to launch the game.\n2.  Enter the username and password you received in your DMs.\n3.  Click \"Login\" and immerse yourself in the world of CloutScape!\n\n### **Key Features & What to Do First**\n\n-   **Explore the World**: Discover familiar landscapes and hidden secrets.\n-   **Train Your Skills**: Level up your combat and non-combat skills to become a formidable player.\n-   **Engage in PvP**: Head to the Wilderness and challenge other players to duels.\n-   **Test Your Luck**: Visit the gambling area and try your hand at our various games of chance.\n-   **Join Events**: Keep an eye on the `#events` channel for exciting server-wide activities.\n\nWe're excited to see you in the game! If you have any questions, don't hesitate to ask in the `#support` channel.\n\n**Happy Scaping!**"
        }
    ],
    "rules": [
        {
            "title": "📜 CloutScape - Server Rules & Guidelines 📜",
            "description": "To ensure a fair, respectful, and enjoyable environment for everyone, all members are expected to adhere to the following rules. Failure to comply may result in warnings, mutes, kicks, or permanent bans.\n\n### **1. Respect and Common Courtesy**\n\n-   **No Harassment or Hate Speech**: Treat all members with respect. We have a zero-tolerance policy for any form of harassment, bullying, racism, sexism, or hate speech.\n-   **No Spamming**: Do not spam channels with excessive messages, images, or mentions. This includes in-game chat.\n-   **No Offensive Content**: Do not post or share any content that is sexually explicit, graphically violent, or otherwise inappropriate.\n\n### **2. Account and Gameplay Rules**\n\n-   **One Account Per Person**: Each player is allowed one primary account. Multi-accounting is strictly prohibited and will result in a permanent ban of all associated accounts.\n-   **No Botting or Macroing**: The use of any third-party software to automate gameplay is forbidden. Play fair and earn your progress legitimately.\n-   **No Bug Abuse**: If you discover a bug, report it immediately to the `#support` channel. Abusing bugs for personal gain will lead to severe penalties.\n-   **No Real-World Trading (RWT)**: The buying or selling of in-game items, currency, or accounts for real money is strictly prohibited.\n\n### **3. Discord and Communication**\n\n-   **Use Appropriate Channels**: Keep conversations relevant to the channel's purpose. For example, use `#bot-commands` for bot interactions and `#general` for casual chat.\n-   **No Advertising**: Do not advertise other Discord servers, websites, or services without explicit permission from an admin.\n-   **No Impersonation**: Do not impersonate staff members or other players.\n\n### **4. PvP and Gambling Conduct**\n\n-   **Honorable PvP**: While the Wilderness is a dangerous place, excessive griefing or targeting of players outside of fair PvP is discouraged.\n-   **No Scamming**: Scamming other players in trades, duels, or any other activity will result in an immediate and permanent ban.\n-   **Responsible Gambling**: Gamble within your means. Do not harass others for loans or stake money.\n\nOur goal is to build a community that is both competitive and supportive. Let's work together to make CloutScape the best RSPS experience for everyone.\n\n**The CloutScape Team**"
        }
    ]
}
